---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.WaterLoopData.ChillerType
source: html/5ce1f39f-01d5-a0d9-6fc5-6a9e8d5418f5.htm
---
# Autodesk.Revit.DB.Mechanical.WaterLoopData.ChillerType Property

The type of water chiller. Note this property change would reset the condenser water loop.

## Syntax (C#)
```csharp
public WaterChillerType ChillerType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration